![image.png]()



 We can think of a DataFrame as a bunch of Series objects put together to share the same index.

**How to install?**

pip install pandas

In [1]:
import numpy as np
import pandas as pd

In [2]:
#Creating the dataframe from dictionaries

dict1 = {'state':['Andra Pradesh' , 'Telangane'] , 'year':[2020 , 2021]}

df = pd.DataFrame(dict1)

In [3]:
df

           state  year
0  Andra Pradesh  2020
1      Telangane  2021

In [4]:
df = pd.DataFrame(dict1 , index = ['row1' , 'row2'])
df

              state  year
row1  Andra Pradesh  2020
row2      Telangane  2021

In [5]:
np.random.seed(10)
df2 = pd.DataFrame(np.random.randn(5,5))

In [6]:
df2

          0         1         2         3         4
0  1.331587  0.715279 -1.545400 -0.008384  0.621336
1 -0.720086  0.265512  0.108549  0.004291 -0.174600
2  0.433026  1.203037 -0.965066  1.028274  0.228630
3  0.445138 -1.136602  0.135137  1.484537 -1.079805
4 -1.977728 -1.743372  0.266070  2.384967  1.123691

In [7]:
np.random.seed(10)
df2 = pd.DataFrame(np.random.randn(5,5) , index = ['row1' , 'row2' , 'row3' , 'row4' , 'row5'] , columns=['col1' , 'col2' , 'col3' , 'col4' , 'col5'])
df2

          col1      col2      col3      col4      col5
row1  1.331587  0.715279 -1.545400 -0.008384  0.621336
row2 -0.720086  0.265512  0.108549  0.004291 -0.174600
row3  0.433026  1.203037 -0.965066  1.028274  0.228630
row4  0.445138 -1.136602  0.135137  1.484537 -1.079805
row5 -1.977728 -1.743372  0.266070  2.384967  1.123691

In [8]:
df2

          col1      col2      col3      col4      col5
row1  1.331587  0.715279 -1.545400 -0.008384  0.621336
row2 -0.720086  0.265512  0.108549  0.004291 -0.174600
row3  0.433026  1.203037 -0.965066  1.028274  0.228630
row4  0.445138 -1.136602  0.135137  1.484537 -1.079805
row5 -1.977728 -1.743372  0.266070  2.384967  1.123691

In [9]:
df2['col1']

row1    1.331587
row2   -0.720086
row3    0.433026
row4    0.445138
row5   -1.977728
Name: col1, dtype: float64

In [10]:
df2['col4']

row1   -0.008384
row2    0.004291
row3    1.028274
row4    1.484537
row5    2.384967
Name: col4, dtype: float64

In [11]:
df2[['col1' , 'col2']]

          col1      col2
row1  1.331587  0.715279
row2 -0.720086  0.265512
row3  0.433026  1.203037
row4  0.445138 -1.136602
row5 -1.977728 -1.743372

In [12]:
#creating a new column

df2['new'] = df2['col1'] + df2['col2']

In [13]:
df2

          col1      col2      col3      col4      col5       new
row1  1.331587  0.715279 -1.545400 -0.008384  0.621336  2.046865
row2 -0.720086  0.265512  0.108549  0.004291 -0.174600 -0.454574
row3  0.433026  1.203037 -0.965066  1.028274  0.228630  1.636064
row4  0.445138 -1.136602  0.135137  1.484537 -1.079805 -0.691465
row5 -1.977728 -1.743372  0.266070  2.384967  1.123691 -3.721101

**Removing Columns**

In [14]:
df2.drop('new' , axis = 1) #not inplace

          col1      col2      col3      col4      col5
row1  1.331587  0.715279 -1.545400 -0.008384  0.621336
row2 -0.720086  0.265512  0.108549  0.004291 -0.174600
row3  0.433026  1.203037 -0.965066  1.028274  0.228630
row4  0.445138 -1.136602  0.135137  1.484537 -1.079805
row5 -1.977728 -1.743372  0.266070  2.384967  1.123691

In [15]:
df2

          col1      col2      col3      col4      col5       new
row1  1.331587  0.715279 -1.545400 -0.008384  0.621336  2.046865
row2 -0.720086  0.265512  0.108549  0.004291 -0.174600 -0.454574
row3  0.433026  1.203037 -0.965066  1.028274  0.228630  1.636064
row4  0.445138 -1.136602  0.135137  1.484537 -1.079805 -0.691465
row5 -1.977728 -1.743372  0.266070  2.384967  1.123691 -3.721101

In [16]:
df2.drop('col1' , axis=1 , inplace=True)

In [17]:
df2

          col2      col3      col4      col5       new
row1  0.715279 -1.545400 -0.008384  0.621336  2.046865
row2  0.265512  0.108549  0.004291 -0.174600 -0.454574
row3  1.203037 -0.965066  1.028274  0.228630  1.636064
row4 -1.136602  0.135137  1.484537 -1.079805 -0.691465
row5 -1.743372  0.266070  2.384967  1.123691 -3.721101

**Removing rows**

In [18]:
df2.drop('row1' , axis=0 , inplace=True)
df2

          col2      col3      col4      col5       new
row2  0.265512  0.108549  0.004291 -0.174600 -0.454574
row3  1.203037 -0.965066  1.028274  0.228630  1.636064
row4 -1.136602  0.135137  1.484537 -1.079805 -0.691465
row5 -1.743372  0.266070  2.384967  1.123691 -3.721101

**Selecting Rows & Columns**

In [19]:
df2.loc['row2']

col2    0.265512
col3    0.108549
col4    0.004291
col5   -0.174600
new    -0.454574
Name: row2, dtype: float64

In [22]:
df2.loc[: , 'col2']

row2    0.265512
row3    1.203037
row4   -1.136602
row5   -1.743372
Name: col2, dtype: float64

In [23]:
df2.iloc[1]

col2    1.203037
col3   -0.965066
col4    1.028274
col5    0.228630
new     1.636064
Name: row3, dtype: float64

In [25]:
df2.iloc[: , 1]

row2    0.108549
row3   -0.965066
row4    0.135137
row5    0.266070
Name: col3, dtype: float64

In [24]:
df2

          col2      col3      col4      col5       new
row2  0.265512  0.108549  0.004291 -0.174600 -0.454574
row3  1.203037 -0.965066  1.028274  0.228630  1.636064
row4 -1.136602  0.135137  1.484537 -1.079805 -0.691465
row5 -1.743372  0.266070  2.384967  1.123691 -3.721101

In [26]:
df2.iloc[: , 1:]

          col3      col4      col5       new
row2  0.108549  0.004291 -0.174600 -0.454574
row3 -0.965066  1.028274  0.228630  1.636064
row4  0.135137  1.484537 -1.079805 -0.691465
row5  0.266070  2.384967  1.123691 -3.721101

In [27]:
df2.loc[: , ['col3' , 'col4']]

          col3      col4
row2  0.108549  0.004291
row3 -0.965066  1.028274
row4  0.135137  1.484537
row5  0.266070  2.384967

**Thank You!!**